In [22]:
import pandas as pd
from sqlalchemy import create_engine, text

In [27]:
#Define the variables for the engine
dialect = 'postgresql'

host = 'applicationspractice.cb2ucueyefq3.eu-north-1.rds.amazonaws.com'
port = 5432
database = 'dwtestpostgre'

user = ''
password = ''

In [28]:
def get_connection(dialect, host, port, database, user, password):
    try:
        #dialect+driver://username:password@host:port/database
        connection_string = f'{dialect}://{user}:{password}@{host}:{port}/{database}'
        engine = create_engine(connection_string)
        return engine
    except:
        print('Error, connection failed!')

In [29]:
engine = get_connection(dialect, host, port, database, user, password)

In [23]:
folder_loc = 'D:\\Study\\Data Engineering and Analytics\\Data Warehouse - Udemy\\'

In [24]:
src_sales = 'Sales.csv'

In [25]:
df_sales = pd.read_csv(folder_loc + src_sales)

In [26]:
df_sales.head()

,transaction_id,transactional_date,product_id,customer_id,payment,credit_card,loyalty_card,cost,quantity,price
0,1,2021-05-04 02:00:00,P0494,4,visa,4041593010498829,F,17.33,2,18.29
1,2,2021-05-04 03:04:00,P0221,5,visa,4041596151234556,F,0.59,1,1.49
2,3,2021-05-04 03:56:00,P0625,5,visa,4041594885335898,F,5.15,3,5.89
3,4,2021-05-04 05:20:00,P0431,8,mastercard,5108753677552345,F,10.67,2,11.59
4,5,2021-05-04 05:45:00,P0058,5,mastercard,5108752372298261,T,11.38,2,12.39

In [30]:
#Write to DB just for test
statement = text('INSERT INTO DW_Practice.Sales (transaction_id, Product_id, cost) VALUES(2, 3, 53)')

In [31]:
with engine.begin() as con:
    result = con.execute(statement)
    con.commit()